controllers/CharactersController.php

UPDATE `characters` SET `is_selected`=0, `is_online`=0 WHERE `user_id`=24
UPDATE `characters` SET `is_selected`=1, `is_online`=1 WHERE (`id`=47) AND (`user_id`=24)
---
    public function actionSelectActive()
    {
        $request = Yii::$app->request;

        if ($request->isPost) {

            $authToken = $request->post('account_auth_token');
            $characterId = $request->post('char_id');

            // Декодирование токена
            $decoded = JWT::decode($authToken, new Key(Yii::$app->params['jwtSecret'], 'HS256'));
            $userId = $decoded->sub;

            // Обновление статуса "is_selected" для персонажей пользователя
            Characters::updateAll(['is_selected' => false, 'is_online' => false], ['user_id' => $userId]);
            Characters::updateAll(['is_selected' => true, 'is_online' => true], ['id' => $characterId, 'user_id' => $userId]);