controllers/UserController.php

UPDATE `users` SET `auth_token`='eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpc3MiOiJzcGVsbGNyYWZ0Iiwic3ViIjoyNCwiaWF0IjoxNzI5NTI1NTY2LCJleHAiOjE3Mjk1MjkxNjYsImtpZCI6MX0.DfsIWzsxlbkFbwv3PAY2zozMLqbe-xn6Yhm9JIfDfkE' WHERE `id`=24
---
    public function actionLogin()
    {
        $request = Yii::$app->request;

        if ($request->isPost) {

            $login = $request->post('login');
            $password = $request->post('password');

            // Поиск пользователя по логину
            $user = Users::findOne(['username' => $login]);

            if ($user) {
                // Проверка пароля с помощью password_verify
                if (password_verify($password, $user->password_hash)) {
                    // Авторизация успешна
                    $token = $this->generateJwtToken($user);
                    $user->auth_token = $token;
                    $user->save();